los-app/backend/loadtest.yml
# Artillery Load Test Configuration
#
# Tests the LOS backend under simulated load of 5000+ concurrent users.
#
# Usage:
#   npx artillery run loadtest.yml
#   npx artillery run loadtest.yml --output report.json
#   npx artillery report report.json  # generates HTML report
#
# Install:
#   npm install -g artillery
#
# Phases simulate realistic ramp-up:
#   1. Warm-up:  50 users/sec for 60s  (steady baseline)
#   2. Ramp-up:  50 → 200 users/sec over 120s
#   3. Peak:     200 users/sec for 120s  (sustained high load)
#   4. Spike:    500 users/sec for 30s   (burst test)

config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 50
      name: "Warm-up"
    - duration: 120
      arrivalRate: 50
      rampTo: 200
      name: "Ramp-up"
    - duration: 120
      arrivalRate: 200
      name: "Sustained peak load"
    - duration: 30
      arrivalRate: 500
      name: "Spike test"
  defaults:
    headers:
      Content-Type: "application/json"
  # Expect p95 < 500ms, p99 < 2000ms
  ensure:
    p95: 500
    p99: 2000

scenarios:
  # Health check (lightweight, tests basic throughput)
  - name: "Health check"
    weight: 30
    flow:
      - get:
          url: "/api/health"

  # Login flow (auth endpoint under load)
  - name: "Login"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "john.smith@republicfinance.com"
            password: "TestPass123!@#"
          capture:
            - json: "$.token"
              as: "token"

  # Authenticated dashboard (pipeline data)
  - name: "Dashboard read"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "sarah.johnson@republicfinance.com"
            password: "TestPass123!@#"
          capture:
            - json: "$.token"
              as: "token"
      - get:
          url: "/api/applications?page=1&limit=20"
          headers:
            Authorization: "Bearer {{ token }}"

  # Reporting dashboard (heavy queries)
  - name: "Executive dashboard"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "victoria.king@republicfinance.com"
            password: "TestPass123!@#"
          capture:
            - json: "$.token"
              as: "token"
      - get:
          url: "/api/reporting/dashboard"
          headers:
            Authorization: "Bearer {{ token }}"

  # Reference data reads (cached endpoints)
  - name: "Reference data"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "sarah.johnson@republicfinance.com"
            password: "TestPass123!@#"
          capture:
            - json: "$.token"
              as: "token"
      - get:
          url: "/api/admin/loan-products"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/admin/branches"
          headers:
            Authorization: "Bearer {{ token }}"