los-app/backend/loadtest.yml
# Artillery Load Test Configuration
#
# Performance test for the LOS backend under simulated load.
# Runs against a live backend server (requires PostgreSQL).
#
# Usage:
#   npx artillery run loadtest.yml
#   npx artillery run loadtest.yml --output report.json
#   npx artillery report report.json  # generates HTML report
#
# Phases simulate realistic ramp-up:
#   1. Warm-up:  10 users/sec for 30s  (steady baseline)
#   2. Ramp-up:  10 -> 50 users/sec over 60s
#   3. Peak:     50 users/sec for 60s  (sustained load)
#   4. Spike:    100 users/sec for 15s (burst test)

config:
  target: "http://localhost:4000"
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Warm-up"
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"
    - duration: 60
      arrivalRate: 50
      name: "Sustained peak load"
    - duration: 15
      arrivalRate: 100
      name: "Spike test"
  defaults:
    headers:
      Content-Type: "application/json"
  # Performance thresholds
  ensure:
    p95: 500
    p99: 2000
    maxErrorRate: 5

scenarios:
  # Health check (lightweight, tests basic throughput)
  - name: "Health check"
    weight: 30
    flow:
      - get:
          url: "/api/health/live"
      - get:
          url: "/api/health"

  # Login flow (auth endpoint under load)
  - name: "Login attempt"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "lo1@republicfinance.com"
            password: "InvalidPasswordForLoadTest"

  # Protected endpoint (returns 401, tests middleware throughput)
  - name: "Protected endpoints"
    weight: 25
    flow:
      - get:
          url: "/api/applications"
      - get:
          url: "/api/admin/users"
      - get:
          url: "/api/reporting/dashboard"

  # Reporting endpoint
  - name: "Reporting"
    weight: 10
    flow:
      - get:
          url: "/api/reporting/pipeline"
      - get:
          url: "/api/reporting/adverse-actions"

  # Reference data reads
  - name: "Reference data"
    weight: 15
    flow:
      - get:
          url: "/api/admin/loan-products"
      - get:
          url: "/api/admin/branches"